Re-wrote readme.md
